summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxDsadc_bf.h
/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN27 */
#define IFX_DSADC_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_OFF (0)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_OFF (1)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_OFF (2)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_OFF (3)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_OFF (4)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_OFF (14)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_OFF (15)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_LEN (5)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_MSK (0x1f)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_OFF (16)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_OFF (2)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_LEN (2)

