summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_OFF (0)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_OFF (4)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_OFF (15)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_OFF (30)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_OFF (3)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_OFF (29)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_OFF (28)

/** \\brief  Length for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_OFF (7)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_OFF (20)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_LEN (1)

