summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxDsadc_bf.h
/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_OFF (19)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_OFF (2)

/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_OFF (3)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_OFF (2)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_OFF (3)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_OFF (18)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_OFF (19)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODREV */
#define IFX_DSADC_ID_MODREV_LEN (8)

